## Staging: idp
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 11 to add, 10 to change, 12 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                                     NAME                                                     |
|----------|--------------------------------------------------------------------------------------------------------------|
| delete   | `module.idp_ecs.aws_ecs_cluster.this[0]`                                                                     |
| update   | `aws_wafv2_web_acl.idp`                                                                                      |
|          | `module.idp_ecs.aws_ecs_service.this`                                                                        |
|          | `module.idp_ecs.aws_iam_policy.this_task_exec`                                                               |
|          | `module.idp_ecs.aws_iam_role.this_task`                                                                      |
|          | `module.idp_ecs.aws_iam_role.this_task_exec`                                                                 |
|          | `module.user_portal_code_pipeline[0].aws_codebuild_project.ecs_render`                                       |
|          | `module.user_portal_code_pipeline[0].aws_codedeploy_deployment_group.this`                                   |
|          | `module.user_portal_code_pipeline[0].aws_codepipeline.this`                                                  |
|          | `module.user_portal_code_pipeline[0].aws_iam_role.this`                                                      |
|          | `module.user_portal_code_pipeline[0].aws_iam_role_policy.codepipeline_policy`                                |
| recreate | `aws_appautoscaling_policy.user_portal_cpu[0]`                                                               |
|          | `aws_appautoscaling_policy.user_portal_memory[0]`                                                            |
|          | `aws_appautoscaling_target.user_portal[0]`                                                                   |
|          | `aws_ecs_cluster.idp`                                                                                        |
|          | `aws_ecs_service.user_portal[0]`                                                                             |
|          | `module.idp_ecs.aws_ecs_task_definition.this`                                                                |
|          | `module.user_portal_code_pipeline[0].aws_codepipeline_webhook.this`                                          |
|          | `module.user_portal_code_pipeline[0].aws_s3_bucket.codepipeline_bucket`                                      |
|          | `module.user_portal_code_pipeline[0].aws_s3_bucket_ownership_controls.codepipeline_bucket`                   |
|          | `module.user_portal_code_pipeline[0].aws_s3_bucket_public_access_block.codepipeline_bucket`                  |
|          | `module.user_portal_code_pipeline[0].aws_s3_bucket_server_side_encryption_configuration.codepipeline_bucket` |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/forms-terraform/actions/runs/21005258287).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_appautoscaling_policy.user_portal_cpu[0] must be replaced
-/+ resource "aws_appautoscaling_policy" "user_portal_cpu" {
      ~ alarm_arns         = [
          - "arn:aws:cloudwatch:ca-central-1:687401027353:alarm:TargetTracking-service/idp/user_portal-AlarmHigh-f918c46e-ebca-40ec-a9e6-93f0c57b77bd",
          - "arn:aws:cloudwatch:ca-central-1:687401027353:alarm:TargetTracking-service/idp/user_portal-AlarmLow-503d5b8c-b9c7-48d6-8735-1546c733e0f5",
        ] -> (known after apply)
      ~ arn                = "arn:aws:autoscaling:ca-central-1:687401027353:scalingPolicy:9bed5cc7-9938-441b-93a4-55ad05612abc:resource/ecs/service/idp/user_portal:policyName/user_portal_cpu" -> (known after apply)
      ~ id                 = "user_portal_cpu" -> (known after apply)
        name               = "user_portal_cpu"
      ~ resource_id        = "service/idp/user_portal" -> "service/auth/user_portal" # forces replacement
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_appautoscaling_policy.user_portal_memory[0] must be replaced
-/+ resource "aws_appautoscaling_policy" "user_portal_memory" {
      ~ alarm_arns         = [
          - "arn:aws:cloudwatch:ca-central-1:687401027353:alarm:TargetTracking-service/idp/user_portal-AlarmHigh-a5a840aa-d2c8-4c56-bf43-8f2241d35a53",
          - "arn:aws:cloudwatch:ca-central-1:687401027353:alarm:TargetTracking-service/idp/user_portal-AlarmLow-72957871-3b79-4c48-8701-e0be3c05d427",
        ] -> (known after apply)
      ~ arn                = "arn:aws:autoscaling:ca-central-1:687401027353:scalingPolicy:9bed5cc7-9938-441b-93a4-55ad05612abc:resource/ecs/service/idp/user_portal:policyName/user_portal_memory" -> (known after apply)
      ~ id                 = "user_portal_memory" -> (known after apply)
        name               = "user_portal_memory"
      ~ resource_id        = "service/idp/user_portal" -> "service/auth/user_portal" # forces replacement
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_appautoscaling_target.user_portal[0] must be replaced
-/+ resource "aws_appautoscaling_target" "user_portal" {
      ~ arn                = "arn:aws:application-autoscaling:ca-central-1:687401027353:scalable-target/0ec59bed5cc79938441b93a455ad05612abc" -> (known after apply)
      ~ id                 = "service/idp/user_portal" -> (known after apply)
      ~ resource_id        = "service/idp/user_portal" -> "service/auth/user_portal" # forces replacement
      ~ role_arn           = "arn:aws:iam::687401027353:role/aws-service-role/ecs.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_ECSService" -> (known after apply)
      - tags               = {} -> null
        # (6 unchanged attributes hidden)

      ~ suspended_state (known after apply)
      - suspended_state {
          - dynamic_scaling_in_suspended  = false -> null
          - dynamic_scaling_out_suspended = false -> null
          - scheduled_scaling_suspended   = false -> null
        }
    }

  # aws_ecs_cluster.idp must be replaced
-/+ resource "aws_ecs_cluster" "idp" {
      ~ arn      = "arn:aws:ecs:ca-central-1:687401027353:cluster/idp" -> (known after apply)
      ~ id       = "arn:aws:ecs:ca-central-1:687401027353:cluster/idp" -> (known after apply)
      ~ name     = "idp" -> "auth" # forces replacement
      - tags     = {} -> null
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_ecs_service.user_portal[0] must be replaced
-/+ resource "aws_ecs_service" "user_portal" {
      ~ arn                                = "arn:aws:ecs:ca-central-1:687401027353:service/idp/user_portal" -> (known after apply)
      ~ cluster                            = "arn:aws:ecs:ca-central-1:687401027353:cluster/idp" -> (known after apply) # forces replacement
      ~ iam_role                           = "/aws-service-role/ecs.amazonaws.com/AWSServiceRoleForECS" -> (known after apply)
      ~ id                                 = "arn:aws:ecs:ca-central-1:687401027353:service/idp/user_portal" -> (known after apply)
        name                               = "user_portal"
      - tags                               = {} -> null
      ~ triggers                           = {} -> (known after apply)
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_wafv2_web_acl.idp will be updated in-place
  ~ resource "aws_wafv2_web_acl" "idp" {
        id                          = "bab5476e-86d5-4718-aa69-55b379a8673d"
        name                        = "idp"
        tags                        = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (11 unchanged attributes hidden)

      - rule {
          - name     = "BlockLargeRequests" -> null
          - priority = 1 -> null

          - action {
              - block {
                }
            }

          - statement {
              - or_statement {
                  - statement {
                      - size_constraint_statement {
                          - comparison_operator = "GT" -> null
                          - size                = 8192 -> null

                          - field_to_match {
                              - cookies {
                                  - match_scope       = "ALL" -> null
                                  - oversize_handling = "MATCH" -> null

                                  - match_pattern {
                                      - excluded_cookies = [] -> null
                                      - included_cookies = [] -> null

                                      - all {}
                                    }
                                }
                            }

                          - text_transformation {
                              - priority = 0 -> null
                              - type     = "NONE" -> null
                            }
                        }
                    }
                  - statement {
                      - size_constraint_statement {
                          - comparison_operator = "GT" -> null
                          - size                = 8192 -> null

                          - field_to_match {
                              - headers {
                                  - match_scope       = "ALL" -> null
                                  - oversize_handling = "MATCH" -> null

                                  - match_pattern {
                                      - excluded_headers = [] -> null
                                      - included_headers = [] -> null

                                      - all {}
                                    }
                                }
                            }

                          - text_transformation {
                              - priority = 0 -> null
                              - type     = "NONE" -> null
                            }
                        }
                    }
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "BlockLargeRequests" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "InvalidHost" -> null
          - priority = 5 -> null

          - action {
              - block {
                }
            }

          - statement {
              - not_statement {
                  - statement {
                      - byte_match_statement {
                          - positional_constraint = "EXACTLY" -> null
                          - search_string         = "auth.forms-staging.cdssandbox.xyz" -> null

                          - field_to_match {
                              - single_header {
                                  - name = "host" -> null
                                }
                            }

                          - text_transformation {
                              - priority = 1 -> null
                              - type     = "COMPRESS_WHITE_SPACE" -> null
                            }
                          - text_transformation {
                              - priority = 2 -> null
                              - type     = "LOWERCASE" -> null
                            }
                        }
                    }
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "InvalidHost" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesAmazonIpReputationList" -> null
          - priority = 10 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesAmazonIpReputationList" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesAmazonIpReputationList" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesKnownBadInputsRuleSet" -> null
          - priority = 30 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesKnownBadInputsRuleSet" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesKnownBadInputsRuleSet" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesLinuxRuleSet" -> null
          - priority = 40 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesLinuxRuleSet" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesLinuxRuleSet" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      + rule {
          + name     = "BlockLargeRequests"
          + priority = 3

          + action {
              + block {
                }
            }

          + statement {
              + or_statement {
                  + statement {
                      + size_constraint_statement {
                          + comparison_operator = "GT"
                          + size                = 8192

                          + field_to_match {
                              + cookies {
                                  + match_scope       = "ALL"
                                  + oversize_handling = "MATCH"

                                  + match_pattern {
                                      + excluded_cookies = []
                                      + included_cookies = []

                                      + all {}
                                    }
                                }
                            }

                          + text_transformation {
                              + priority = 0
                              + type     = "NONE"
                            }
                        }
                    }
                  + statement {
                      + size_constraint_statement {
                          + comparison_operator = "GT"
                          + size                = 8192

                          + field_to_match {
                              + headers {
                                  + match_scope       = "ALL"
                                  + oversize_handling = "MATCH"

                                  + match_pattern {
                                      + excluded_headers = []
                                      + included_headers = []

                                      + all {}
                                    }
                                }
                            }

                          + text_transformation {
                              + priority = 0
                              + type     = "NONE"
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "BlockLargeRequests"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "InvalidHost"
          + priority = 5

          + action {
              + block {
                }
            }

          + statement {
              + not_statement {
                  + statement {
                      + byte_match_statement {
                          + positional_constraint = "EXACTLY"
                          + search_string         = "auth.forms-staging.cdssandbox.xyz"

                          + field_to_match {
                              + single_header {
                                  + name = "host"
                                }
                            }

                          + text_transformation {
                              + priority = 1
                              + type     = "COMPRESS_WHITE_SPACE"
                            }
                          + text_transformation {
                              + priority = 1
                              + type     = "LOWERCASE"
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "InvalidHost"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesAmazonIpReputationList"
          + priority = 10

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesAmazonIpReputationList"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesAmazonIpReputationList"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesKnownBadInputsRuleSet"
          + priority = 30

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesKnownBadInputsRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesKnownBadInputsRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesLinuxRuleSet"
          + priority = 40

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesLinuxRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesLinuxRuleSet"
              + sampled_requests_enabled   = true
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.idp_ecs.data.aws_ecs_cluster.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_cluster" "this" {
      + arn                                  = (known after apply)
      + cluster_name                         = "idp"
      + id                                   = (known after apply)
      + pending_tasks_count                  = (known after apply)
      + region                               = (known after apply)
      + registered_container_instances_count = (known after apply)
      + running_tasks_count                  = (known after apply)
      + service_connect_defaults             = (known after apply)
      + setting                              = (known after apply)
      + status                               = (known after apply)
      + tags                                 = (known after apply)
    }

  # module.idp_ecs.data.aws_iam_policy_document.this_task_assume will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "this_task_assume" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]

          + principals {
              + identifiers = [
                  + "ecs-tasks.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.idp_ecs.data.aws_iam_policy_document.this_task_exec_assume will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "this_task_exec_assume" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]

          + principals {
              + identifiers = [
                  + "ecs-tasks.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.idp_ecs.data.aws_iam_policy_document.this_task_exec_combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + (known after apply),
          + (known after apply),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ssm:GetParameters",
                              + "ssm:GetParameter",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:ssm:ca-central-1:687401027353:parameter/zitadel_secret_key",
                              + "arn:aws:ssm:ca-central-1:687401027353:parameter/zitadel_database_name",
                              + "arn:aws:ssm:ca-central-1:687401027353:parameter/zitadel_database_host",
                              + "arn:aws:ssm:ca-central-1:687401027353:parameter/zitadel_admin_username",
                              + "arn:aws:ssm:ca-central-1:687401027353:parameter/zitadel_admin_password",
                              + "arn:aws:ssm:ca-central-1:687401027353:parameter/idp_database_cluster_admin_username",
                              + "arn:aws:ssm:ca-central-1:687401027353:parameter/idp_database_cluster_admin_password",
                            ]
                          + Sid      = "GetSSMParameters"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
        ]
    }

  # module.idp_ecs.data.aws_iam_policy_document.this_task_exec_ecr will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "this_task_exec_ecr" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:GetAuthorizationToken",
              + "ecr:GetDownloadUrlForLayer",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
    }

  # module.idp_ecs.data.aws_iam_policy_document.this_task_exec_logs will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "this_task_exec_logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:DescribeLogGroups",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:ca-central-1:687401027353:log-group:/aws/ecs/idp/zitadel:*",
            ]
        }
    }

  # module.idp_ecs.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + region      = (known after apply)
    }

  # module.idp_ecs.aws_ecs_cluster.this[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_ecs_cluster" "this" {
      - arn      = "arn:aws:ecs:ca-central-1:687401027353:cluster/idp" -> null
      - id       = "arn:aws:ecs:ca-central-1:687401027353:cluster/idp" -> null
      - name     = "idp" -> null
      - region   = "ca-central-1" -> null
      - tags     = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null

      - setting {
          - name  = "containerInsights" -> null
          - value = "enabled" -> null
        }
    }

  # module.idp_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:687401027353:service/idp/zitadel"
        name                               = "zitadel"
        tags                               = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "zitadel:39" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.idp_ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:687401027353:task-definition/zitadel:40" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:687401027353:task-definition/zitadel" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - command                = [
                      - "start-from-init",
                      - "--masterkeyFromEnv",
                      - "--tlsMode",
                      - "external",
                      - "--config",
                      - "/app/config.yaml",
                      - "--steps",
                      - "/app/steps.yaml",
                    ]
                  - environment            = [
                      - {
                          - name  = "ZITADEL_EXTERNALDOMAIN"
                          - value = "auth.forms-staging.cdssandbox.xyz"
                        },
                    ]
                  - essential              = true
                  - image                  = "687401027353.dkr.ecr.ca-central-1.amazonaws.com/idp/zitadel:latest"
                  - linuxParameters        = {
                      - capabilities = {
                          - add  = []
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration       = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/idp/zitadel"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "task"
                        }
                    }
                  - mountPoints            = []
                  - name                   = "zitadel"
                  - portMappings           = [
                      - {
                          - containerPort = 8080
                          - hostPort      = 8080
                          - protocol      = "tcp"
                        },
                    ]
                  - readonlyRootFilesystem = true
                  - secrets                = [
                      - {
                          - name      = "ZITADEL_DATABASE_POSTGRES_ADMIN_PASSWORD"
                          - valueFrom = "arn:aws:ssm:ca-central-1:687401027353:parameter/idp_database_cluster_admin_password"
                        },
                      - {
                          - name      = "ZITADEL_DATABASE_POSTGRES_ADMIN_USERNAME"
                          - valueFrom = "arn:aws:ssm:ca-central-1:687401027353:parameter/idp_database_cluster_admin_username"
                        },
                      - {
                          - name      = "ZITADEL_DATABASE_POSTGRES_DATABASE"
                          - valueFrom = "arn:aws:ssm:ca-central-1:687401027353:parameter/zitadel_database_name"
                        },
                      - {
                          - name      = "ZITADEL_DATABASE_POSTGRES_HOST"
                          - valueFrom = "arn:aws:ssm:ca-central-1:687401027353:parameter/zitadel_database_host"
                        },
                      - {
                          - name      = "ZITADEL_DATABASE_POSTGRES_USER_PASSWORD"
                          - valueFrom = "arn:aws:ssm:ca-central-1:687401027353:parameter/idp_database_cluster_admin_password"
                        },
                      - {
                          - name      = "ZITADEL_DATABASE_POSTGRES_USER_USERNAME"
                          - valueFrom = "arn:aws:ssm:ca-central-1:687401027353:parameter/idp_database_cluster_admin_username"
                        },
                      - {
                          - name      = "ZITADEL_FIRSTINSTANCE_ORG_HUMAN_PASSWORD"
                          - valueFrom = "arn:aws:ssm:ca-central-1:687401027353:parameter/zitadel_admin_password"
                        },
                      - {
                          - name      = "ZITADEL_FIRSTINSTANCE_ORG_HUMAN_USERNAME"
                          - valueFrom = "arn:aws:ssm:ca-central-1:687401027353:parameter/zitadel_admin_username"
                        },
                      - {
                          - name      = "ZITADEL_MASTERKEY"
                          - valueFrom = "arn:aws:ssm:ca-central-1:687401027353:parameter/zitadel_secret_key"
                        },
                    ]
                  - systemControls         = []
                  - volumesFrom            = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "zitadel" -> (known after apply)
      ~ revision                 = 40 -> (known after apply)
        tags                     = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.idp_ecs.aws_iam_policy.this_task_exec will be updated in-place
  ~ resource "aws_iam_policy" "this_task_exec" {
        id               = "arn:aws:iam::687401027353:policy/zitadel_ecs_task_exec_policy"
        name             = "zitadel_ecs_task_exec_policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
            ...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener_rule.idp_protocol_version"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener_rule.user_portal[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_appautoscaling_target.user_portal[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.user_portal"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_cluster.idp"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_service.user_portal[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.user_portal"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.ecs_xray"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.idp_send_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.user_portal_ssm"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.idp_user_portal"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.idp_send_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_shield_protection.idp"]
WARN - plan.json - main - Missing Common Tags: ["module.user_portal_code_pipeline[0].aws_codebuild_project.ecs_render"]
WARN - plan.json - main - Missing Common Tags: ["module.user_portal_code_pipeline[0].aws_codedeploy_app.this"]
WARN - plan.json - main - Missing Common Tags: ["module.user_portal_code_pipeline[0].aws_codedeploy_deployment_group.this"]
WARN - plan.json - main - Missing Common Tags: ["module.user_portal_code_pipeline[0].aws_codepipeline.this"]
WARN - plan.json - main - Missing Common Tags: ["module.user_portal_code_pipeline[0].aws_codepipeline_webhook.this"]
WARN - plan.json - main - Missing Common Tags: ["module.user_portal_code_pipeline[0].aws_codestarconnections_connection.this"]
WARN - plan.json - main - Missing Common Tags: ["module.user_portal_code_pipeline[0].aws_iam_role.this"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
